# TAP REPOS
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"



# BREW PACKAGES
brew "ack"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "ffmpeg" # for being able to manipulate videos for example
brew "fish"
brew "git"
brew "git-open"
brew "htop"
brew "jq"
brew "mas"
brew "mongodb-community"
brew "p7zip"
brew "parallel"
brew "postgresql"
brew "python"
brew "python@2"
brew "redis"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "z"
brew "heroku/brew/heroku"
brew "imagemagick"
brew "the_silver_searcher"
brew "starship"


# CASK PACKAGES
cask "alfred.rb"
cask "bartender"
cask "docker"
cask "font-fira-mono-for-powerline"
cask "foxitreader"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "ngrok"
cask "slack"
cask "spotify"
cask "tunnelblick"
cask "visual-studio-code"
cask "cleanmymac"


# STORE APPS
mas "Skitch", id: 425955336


